app/views/orders/_form.html.erb

SELECT "employees".* FROM "employees"
---
    <h4>Funcionário</h4>
    <%= f.select :employee_id,
                  Employee.all.collect { |p| [ p.name , p.id ] },
                  {include_blank: t('employee_select')} %>

SELECT "dishes".* FROM "dishes"
---
    <h4>Prato</h4>
    <%= f.select :dish_id,
                  Dish.all.collect {|p| [p.name, p.id]},{