app/controllers/dishes_controller.rb

SELECT "dishes".* FROM "dishes"
SELECT  "dishes".* FROM "dishes"  LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "dishes"
---
  def index
    @dishes = Dish.all

    @dishes = Dish.paginate(:page => params[:page], :per_page => 7)

INSERT INTO "dishes" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-11-27 12:22:12.690635"], ["name", "Sobá"], ["updated_at", "2014-11-27 12:22:12.690635"]]
---
  def create
    @dish = Dish.new(dish_params)

    respond_to do |format|
      if @dish.save

DELETE FROM "dishes" WHERE "dishes"."id" = ?  [["id", 980190962]]
---
  def destroy
    @dish.destroy

SELECT  "dishes".* FROM "dishes"  WHERE "dishes"."id" = ? LIMIT 1  [["id", 980190962]]
---
    def set_dish
      @dish = Dish.find(params[:id])