app/controllers/dishes_controller.rb

  def index
    @dishes = Dish.paginate(:page => params[:page], :per_page => 7).order(:name)
---
SELECT  "dishes".* FROM "dishes"   ORDER BY "dishes"."name" ASC LIMIT 7 OFFSET 0