app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees"
SELECT  "employees".* FROM "employees"   ORDER BY name asc LIMIT 7 OFFSET 0
SELECT COUNT(*) FROM "employees"
---
  def index
    @employees = Employee.all
    @employees = Employee.paginate(:page => params[:page], :per_page => 7)

INSERT INTO "employees" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-11-27 12:21:55.531152"], ["name", "Carlos Gustavo"], ["updated_at", "2014-11-27 12:21:55.531152"]]
---
  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save

UPDATE "employees" SET "name" = ?, "updated_at" = ? WHERE "employees"."id" = 2  [["name", "Marcelo Gennaro "], ["updated_at", "2014-11-27 17:58:17.156542"]]
---
  def update
    respond_to do |format|
      if @employee.update(employee_params)

DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 980190962]]
---
  def destroy
    @employee.destroy

SELECT  "employees".* FROM "employees"  WHERE "employees"."id" = ? LIMIT 1  [["id", 980190962]]
---
    def set_employee
      @employee = Employee.find(params[:id])