app/controllers/homes_controller.rb

  def index
    @orders = Order.where(date: [Date.today.beginning_of_month..Date.today.end_of_month])
---
SELECT "orders".* FROM "orders"  WHERE (("orders"."date" BETWEEN '2014-11-01' AND '2014-11-30' OR 1=0))

  def show
    @orders = Order.where(date: [Date.today.beginning_of_month..Date.today.end_of_month])
    @date = params[:month] ? Date.parse(params[:month]) : Date.today
    results = Employee.where("name LIKE '%#{ params[:search]}%'")
    @employees = results.paginate(:page => params[:page], :per_page => 7)
---
SELECT "orders".* FROM "orders"  WHERE (("orders"."date" BETWEEN '2014-12-01' AND '2014-12-31' OR 1=0))
SELECT  "employees".* FROM "employees"  LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "employees"