app/controllers/orders_controller.rb

  def index
    @orders = Order.where(date: [Date.today.beginning_of_month..Date.today.end_of_month])
    @date = params[:month] ? Date.parse(params[:month]) : Date.today
    @qtde = 0
    @employees = Employee.all
    @orders = Order.paginate(:page => params[:page], :per_page => 7)
---
SELECT "orders".* FROM "orders"  WHERE (("orders"."date" BETWEEN '2014-11-01' AND '2014-11-30' OR 1=0))
SELECT "employees".* FROM "employees"
SELECT  "orders".* FROM "orders"  LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "orders"

  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("created_at", "date", "dish_id", "employee_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-11-27 12:22:29.350220"], ["date", "2014-11-28"], ["dish_id", 1], ["employee_id", 1], ["updated_at", "2014-11-27 12:22:29.350220"]]